#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>
/*
                            Descrição da questão

 Implemente a função abaixo que devolve o número de dígitos na string s.

        int strcountd(char *s)

    Ex:
    strcountd("15 abacates")        --> 2
    strcountd("Quinze abacates")    --> 0


Funcionando?
    Sim - (V)
    Não - ()
*/
//-------------- PROTÓTIPOS DAS FUNÇÕES ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

int strcountd(char *s);
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int main()
{
    printf("Hello world!\n\n");

//------ Definindo elementos
    char *s = "Quinze Abacates, 30 bananas e 21 macas";
    char str[100];

//------ Armazenando o input do usuário
    printf("Insira uma string qualquer (pode ser alfanumerica): ");
    gets(str);

//------ Imprimindo o resultado
    printf("\nA string: \"%s\" possui %d digitos.\n", s, strcountd(s));
    printf("\nA string: \"%s\" possui %d digitos.\n", str, strcountd(str));

//------ .The End...?
    return 0;
}
//-------------- FUNÇÕES -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

int strcountd(char *s)
{
    int i;
    int cont = 0;

    for(i = 0; s[i] != '\0'; i++)
    {
        if(isdigit(s[i]))
        {
            cont++;
        }
    }
    return cont;
}

//-------------- COMENTÀRIOS ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/*

//(1)//
    Ex:
"Quando sair do if...incrementação seja = 0."

//(2)//
"..."

*/
