#include <stdio.h>
#include <stdlib.h>
#include <ctype.h>

#define DIM 21
/*
                            Descrição da questão

 Escreva um programa que leia nomes e sobrenomes de pessoas e os mostre na tela no
formato sobrenome, nome. O programa deve terminar quando um nome vazio for introduzido.

        void função()


Funcionando?
    Sim - ()
    Não - ()
*/
//-------------- PROTÓTIPOS DAS FUNÇÕES ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

void funcao();
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
int main()
{
    printf("Hello world!\n\n");

//------ Definindo elementos
    char nome[DIM];
    char sobrenome[DIM];

//------ Armazenando o input do usuário
    while(1)
    {
        printf("Insira o seu Primeiro nome: ");
        gets(nome);
        if(nome[0] == '\0')
        {
            printf("Programa encerrado.\n");
            break;
        }
        else
        {
            printf("Insira o seu Sobrenome: ");
            gets(sobrenome);
        }
        printf("%s, %s.\n\n", sobrenome, nome);
    }


//------ Imprimindo o resultado

//------ .The End...?
    return 0;
}
//-------------- FUNÇÕES -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

void funcao()
{


    return 0;
}

//-------------- COMENTÀRIOS ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
/*

//(1)//
    Ex:
"Quando sair do if...incrementação seja = 0."

//(2)//
"..."

*/
